app/controllers/requests_controller.rb

INSERT INTO "catrentalrequests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 17], ["start_date", "2019-08-05"], ["end_date", "2019-08-08"], ["created_at", "2019-08-05 20:23:21.516239"], ["updated_at", "2019-08-05 20:23:21.516239"]]
---
    def create
        new_request = Catrentalrequest.new(params.require(:request).permit(:cat_id,:start_date, :end_date))
        if new_request.save