app/models/catrentalrequest.rb

  def does_not_overlap_approved_request
    if overlapping_approved_requests.any?
---
SELECT  1 AS one FROM "catrentalrequests" WHERE "catrentalrequests"."cat_id" = $1 AND "catrentalrequests"."id" IS NOT NULL AND NOT (start_date > '2019-08-05' OR end_date < '2019-08-01') AND (status = 'APPROVED') LIMIT $2  [["cat_id", 16], ["LIMIT", 1]]